Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/udir.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: Using digital communication and cooperation tools means preparing, presenting and publishing one's own and joint multimedia products, and communicating and cooperating with pupils from other schools and countries.
nn: Å bruke digitale kommunikasjons- og samarbeidsreiskapar inneber å utarbeide, presentere og publisere eigne og felles multimediale produkt, kommunisere og samarbeide med elevar frå andre skular og land.

source: Also covered are the rules and regulations that govern copyright, privacy protection and freedom of expression.
nn: Det omfattar òg regelverk som gjeld opphavsrett, personvern og ytringsfridom.

source: After Vg1/Vg2 in upper secondary education
nn: Etter Vg1/Vg2 i vidaregåande opplæring

source: The teaching and training shall fuel the
nn: Opplæringa skal fremje motivasjonen, haldningane og

source: Øystein’s greatest challenge as the head teacher of a farm kindergarten is patience.
nn: Øysteins største utfordring som styrar i ein gardsbarnehage er tolmod.

source: search for information, create, store and retrieve texts using digital tools
nn: søkje etter informasjon, skape, lagre og finne att tekstar ved hjelp av digitale verktøy

source: provide examples of how religion and ethnic variation influence society and culture
nn: gje døme på korleis religion og etnisk variasjon påverkar samfunn og kultur

source: give the pupils the platform for dealing with disagreements and conflicts, and for seeking
nn: argumentere for eigne syn gir elevane eit grunnlag for å handtere usemje og konfliktar, og for

source: assess, choose and act in an environmentally aware way
nn: vurdere, velje og handle miljøbevisst

source: This is true of children, too.
nn: Det gjeld òg barn.

source: Algebra is also used in connection with the other main subject areas.
nn: Algebra blir òg nytta i samband med hovudområda

source: demonstrate good judgment when they express themselves about others and shall ensure
nn: Skolen skal lære elevane å utvise dømmekraft når dei ytrar seg om andre, og sørgje for at dei

source: the causes and consequences of terrorism and genocide, such as the Holocaust, and
nn: årsaker til og konsekvensar av terrorhandlingar og folkemord, som holocaust, og

source: The elective subject covers cultural heritage work from a selection of arts, crafts, foods, architecture, cultural monuments, storytelling, music or local history.
nn: Valfaget omfattar arbeid med den kulturelle arven innan eit utval av kunst, handverk, mat, arkitektur, kulturminne, munnleg forteljing, musikk eller lokalhistorie.

source: select and evaluate information from the library and digital information channels
nn: velje ut og vurdere informasjon frå bibliotek og digitale informasjonskanalar

source: Composing nutritionally safe and good food in accordance with recommendations for a healthy diet from the health authorities is an important foundation on which to base the teaching in this main area.
nn: Å setje saman ernæringsmessig trygg og god mat i samsvar med tilrådingar for eit sunt kosthald frå helsestyresmaktene er eit viktig grunnlag for opplæringa innanfor hovudområdet.

source: prepare food for different social contexts and discuss how food helps to create identity
nn: lage mat for ulike sosiale samanhengar og drøfte korleis mat er med påå skape identitet

source: describe the development and consequences of using tobacco and narcotics in Norway and discuss attitudes to intoxicants
nn: beskrive utvikling og konsekvensar av tobakks- og rusmiddelbruk i Noreg og diskutere haldningar til rusmiddel

source: understand simple messages
nn: medium, individ og samfunn

source: In an average Norwegian kindergarten, a kindergarten teacher spends about 60 per cent of the working day with the children, and a little less than 40 per cent on other tasks.
nn: I ein gjennomsnittleg norsk barnehage er ein barnehagelærar saman med barna vel 60 prosent av dagen, mens knappe 40 prosent av arbeidsdagen blir brukt på andre oppgåver.

source: What are proper values?
nn: Kva er rette verdiar?

source: draw shapes and depth using techniques such as overlapping and reduction
nn: teikne form og djupn ved bruk av verkemiddel som overlapping og forminsking

source: Teaching in the subject shall contribute to helping the pupils experience joy, inspiration and a sense of mastery by being physically active and by interacting with others.
nn: Kroppsøving skal medverke til at elevane opplever glede, meistring og inspirasjon ved å vere med i ulike aktivitetar og i aktivitet saman med andre.

source: This also has linguistic aspects, such as reasoning and communicating ideas.
nn: Dette har òg språklege aspekt, som det å resonnere og kommunisere idear.

source: Written skills may be writing one’s own recipes and procedures, preparing invitations and illustrations and assessing activities.
nn: Skriftlege ferdigheiter kan vere å skrive eigne oppskrifter og framgangsmåtar, lage invitasjonar og illustrasjonar og vurdere aktivitetar.

source: different sources of knowledge and think critically about how knowledge is developed.
nn: og tenkje kritisk om korleis kunnskap blir utvikla.

source: explore, describe and compare the properties of two and three
nn: utforske, beskrive og samanlikne eigenskapar ved to- og

source: The pupils shall be given the opportunity to explore and experiment.
nn: Elevane skal få moglegheit til å utforske og prøve seg fram.

source: Culture, society and literature
nn: ferdast ved og på vatn og gjere greie for farane

source: promote the joy of movement and mastering.
nn: måte som fremjar rørsleglede og meistring.

source: They must gain experience and practise different forms of democratic participation in
nn: Dei skal få erfaring med og praktisere ulike former for demokratisk deltaking og

source: compare and show similarities and differences between countries in Europe and countries in other regions of the world
nn: samanlikne og påvise likskapar og skilnader mellom land i Europa og land i andre verdsdelar

source: in the Physical Education involves being able to find, interpret and understand information from specific texts dealing with the subject.
nn: i kroppsøving handlar om å kunne hente, tolke og forstå informasjon frå fagspesifikke tekstar.

source: in geography means describing places and explaining relations and causes, and discussing and analysing geographical topics.
nn: i geografi inneber å omtale stader og forklare samanhengar og årsaker, og å diskutere og argumentere med utgangspunkt i geografiske tema.

source: different platforms for digital interaction and
nn: ulike plattformer for digital samhandling og

source: The pupils demonstrate and develop competence in the subject in year 6 when they use mathematical terminology in communication and argumentation.
nn: Elevane viser og utviklar kompetanse i faget på 6. trinn når dei bruker matematiske omgrep i kommunikasjon og argumentasjon.

source: explore and explain relationships between addition and subtraction and
nn: utforske og forklare samanhengar mellom addisjon og subtraksjon og

source: develop and use well-reasoned strategies to perform calculations using
nn: utvikle og bruke formålstenlege strategiar i rekning med brøk,

source: Curriculum 2T is more theoretical, while variant 2P is more practical.
nn: Læreplan 2T er meir teoretisk orientert, medan læreplan 2P er meir praktisk orientert.

source: They also demonstrate and develop competence when they explore and generalise mathematical relationships and structures using algebra and well-reasoned representations.
nn: Elevane viser og utviklar òg kompetanse når dei utforskar og generaliserer matematiske samanhengar og strukturar gjennom algebra og formålstenlege representasjonar.

source: Being able to use digital tools
nn: Å kunne bruke digitale verktøy

source: The teaching and training shall give the pupils an
nn: Opplæringa skal gi elevane forståing for samanhengen mellom

source: Number and algebra
nn: Hovudområdet tal og algebra

source: In the Biology programme subject, basic skills are understood as follows:
nn: I biologi forstår ein grunnleggjande ferdigheiter slik:

source: talk about tolerance and how encounters between different cultures may be rewarding and may lead to conflicts
nn: samtale om toleranse og om korleis møte mellom ulike kulturar kan vere både gjevande og konfliktfylte

source: The pupils demonstrate and develop competence in the subject when they use knowledge about nature and society to explore and reflect on different geographic conditions.
nn: Elevane viser og utviklar kompetanse i geografi når dei nytter kunnskap om natur og samfunn til å utforske og reflektere over ulike geografiske forhold.

source: create narratives about people in the past and use these narratives to show how people think and act based on the community they are living in
nn: skape forteljingar om menneske i fortida og bruke dei til å vise korleis menneske tenkjer og handlar ut frå samfunnet dei lever i

source: The teaching in the subject shall contribute to promoting a healthy lifestyle.
nn: Opplæringa i faget skal medverke til ein medviten og helsefremjande livsstil.

source: in the sandbox to help Emma and Sebastian dig a hole to China, they love her for it, and with good reason.
nn: i sandkassa og hjelper Emma og Sebastian med å grave ned til kinesarane, elskar dei henne for det og med god grunn.

source: give an account of the Norwegian language debate and language policies from 1900 until the present day
nn: gjere greie for norsk språkdebatt og språkpolitikk fråår 1900 til i dag

source: Hence mathematical proficiency is required to understand and influence processes in society.
nn: På den måten er matematisk kompetanse nødvendig for å forstå og kunne påverke prosessar i samfunnet.

source: Throughout the ages, humankind has used and developed mathematics to explore the universe, to systematise experiences and to understand relationships in nature and society.
nn: Mennesket har til alle tider brukt og utvikla matematikk for å utforske universet, for å systematisere erfaringar og for å beskrive og forstå samanhengar i naturen og i samfunnet.

source: give feedback on texts created by others based on technical criteria and to modify their own texts based on feedback they receive
nn: gje tilbakemelding på andre sine tekstar ut frå faglege kriterium, og bearbeide eigne tekstar på bakgrunn av tilbakemeldingar

source: The pupils may also be selected for a Norwegian oral skills exam.
nn: Elevane kan òg trekkjast ut til munnleg eksamen i norsk.

source: Technological competence and knowledge about the links between technology and the
nn: kompetanse og kunnskap om samanhengen mellom teknologi og dei sosiale, økonomiske

source: interdisciplinary topics by working with issues from various subjects.
nn: arbeid med problemstillingar frå ulike fag.

source: in Media and information knowledge involves imparting information and opinions through a variety of communicative expressions, such as text, sound and images, on different levels.
nn: i medie- og informasjonskunnskap inneber å formidle informasjon og meiningar i ulike kommunikasjonsuttrykk, som tekst, lyd og bilde på ulike nivå.

source: “There are many ways to be children and parents in Denmark today.
nn: – Det er mange måtar å vere barn og foreldre på i Danmark i dag.

source: The grade awarded for coursework shall reflect the overall competence of the pupil in social science after completing the subject.
nn: Standpunktkarakteren skal vere uttrykk for den samla kompetansen eleven har i samfunnskunnskap ved avslutninga av opplæringa i faget.

source: master key rules of morphology and orthography and write texts with varied syntax and functional punctuation
nn: skrive samanhengande med personleg og funksjonell handskrift, og bruke tastatur på ein føremålstenleg måte

source: give an account of the structure and reproduction of bacteria and viruses, and relate this to processes in nature, industry and healthcare
nn: gjere greie for oppbygginga og formeiringa til bakteriar og virus, og relatere det til prosessar i natur, industri og helsefagleg samanheng

source: create texts that combine words or signs, picture and sound or visual effects with and without digital tools
nn: lage tekstar som kombinerer ord, lyd og bilete, med og utan digitale verktøy

source: He was interested in identifying what ethical reflections staff had made regarding the use of ICT.
nn: Han var interessert i å finne ut av kva for etiske refleksjonar dei tilsette gjorde rundt bruken av IKT.

source: the causes and consequences of key historical and contemporary conflicts, and
nn: årsaker til og konsekvensar av sentrale historiske og notidige konfliktar og

source: assess the use and misuse of resources, consequences this might have for the environment and society, and conflicts this can create locally and globally
nn: vurdere bruk og misbruk av ressursar, konsekvensar det kan få for miljøet og samfunnet, og konfliktar det kan skape lokalt og globalt

source: use different units of measurement for length and mass in practical
nn: bruke ulike måleiningar for lengd og masse i praktiske situasjonar og

source: other and across subjects.
nn: kvarandre og på tvers av fag.

source: The basic skills are integrated in the competence aims where they contribute to development of the competence in the subject, while also being part of this competence.
nn: Grunnleggjande ferdigheiter er integrerte i kompetansemåla, der dei medverkar til å utvikle fagkompetansen og er ein del av han.

source: ‘I have 100 ideas about things I’d like to do.
nn: – Eg har 100 idear til kva eg har lyst å gjere.

source: social relations of each pupil, and for the ability to participate in education, work and
nn: utviklinga av identitet og sosiale relasjonar hos elevane og for å kunne delta i utdanning,

source: compare life and work in Norway with some other countries
nn: samanlikne liv og virke i Noreg og i nokre andre land

source: This involves problem solving and inquiry, based on practical, everyday situations and mathematical problems.
nn: Det handlar om problemløysing og utforsking som tek utgangspunkt i praktiske, daglegdagse situasjonar og matematiske problem.

source: elaborate on different uses of biomass as an energy source
nn: praktisere friluftsliv med naturen som matkjelde

source: compare the main features and energy exchange in aerobic and anaerobic degradation of glucose, and link the energy conversion in cells to the composition of nutrients in food
nn: samanlikne hovudtrekka og energiutbytet i aerob og anaerob nedbryting av glukose, og knyte energiomsetjing i celler til samansetjing av næringsstoff i kosthaldet

source: problems from play and everyday life
nn: problem frå leik og eigen kvardag

source: It also means studying new areas of the subject by understanding more advanced biological literature.
nn: Å setje seg inn i nye område av faget ved å forstå stadig meir krevjande biologisk litteratur er ein del av kompetansen.

source: “Kindergarten teachers want themselves to develop a conscious and justifiable practice to map and evaluate children’s well-being and development in the kindergartens,” declare the researchers Liv Torunn Eik and Gerd Sylvi Steinnes after having fulfilled a research and development project on this subject in two Norwegian kindergartens.
nn: Barnehagelærarane ønskjer sjølve å utvikle ein bevisst og forsvarleg praksis for å kartleggje og vurdere korleis barn trivst og utviklar seg i barnehagen, seier forskarane Liv Torunn Eik og Gerd Sylvi Steinnes etter å ha gjennomført eit forskings- og utviklingsprosjekt knytt til temaet i to norske barnehagar.

source: In working with this topic the pupils shall develop competence which enables them to make
nn: Gjennom arbeid med temaet skal elevane utvikle kompetanse som gjer dei i stand til å ta

source: create and present their own media products in various combinations of text, sound and images, and justify the choice of medium and publication form
nn: skape og presentere eigne medieprodukt i ulike kombinasjonar av tekst, lyd og bilde og grunngje val av medium og publiseringsform

source: ‘The recent graduates encouraged children to play and explore and they talked with them a lot.
nn: – Dei nyutdanna støtta barnas leik og utforsking og snakka mykje med dei.

source: While technological development may help to solve problems, it may
nn: Teknologiutvikling kan bidra til å løyse problem, men kan òg skape nye.

source: cell references and formulas
nn: cellereferansar og formlar

source: discuss and elaborate on the ideas and forces that led to the American struggle for freedom and the French revolution, and the consequences these had for the development of democracy in Norway
nn: gjere greie for idear og krefter som førte til den amerikanske fridomskampen og den franske revolusjonen, og beskrive følgjer dette fekk for den demokratiske utviklinga i Noreg

source: The children had to cooperate to play games.
nn: Barna måtte samarbeide om spela.

source: The teaching and training shall be given in cooperation andunderstanding with the home, and this cooperation shall contribute tostrengthening the pupils' learning and development.
nn: Opplæringa skal skje i samarbeid og forståing med heimen, ogsamarbeidet skal bidra til å styrkje læringa og utviklinga til elevane.God kommunikasjon mellom heim og skole bidrar positivt til skolen sitt arbeid med

source: reflect on how they can prevent the violation of human dignity.
nn: menneskeverdet og reflektere over korleis dei kan hindre at det blir krenkt.

source: This main subject area focuses on socialisation, politics, economics and culture and deals with people's sense of community and differences and contrasts in a contemporary perspective.
nn: Hovudområdet omfattar emna sosialisering, politikk, økonomi og kultur og handlar om samkjensle og motsetnader mellom menneske i eit samtidsperspektiv.

source: identify basic differences between the political parties in Norway and argue from different political viewpoints
nn: identifisere grunnleggjande skilnader mellom dei politiske partia i Noreg, og argumentere frå ulike politiske ståstader

source: give an account of key aspects of structure and policy with respect to the international media
nn: gjere greie for sentrale trekk ved internasjonal mediestruktur og internasjonal mediepolitikk

source: But in the beginning of 2000, something changed.
nn: Men i byrjinga av 2000-talet blei noko endra.

source: Furthermore, mathematical symbols and the formal mathematical language are used.
nn: I tillegg nyttar ein matematiske symbol og det formelle språket i faget.

source: Law shall help the individual view an issue from more than one side, differentiate between law and justice and reflect on whether laws are legally and ethically sound.
nn: Rettslære skal bidra til at ein kan sjå ei sak frå fleire sider, skilje mellom rett og rettferd og reflektere over om lovene er juridisk og etisk gode.

source: It may also include judging the quality of a product or process.
nn: Vi kan òg reflektere over eit saksforhold, praktiske aktivitetar eller eiga læring.

source: Forgiveness, charity and solidarity are
nn: Tilgiving, nestekjærleik og solidaritet er nødvendig for at
